<script setup>
import { useRoute } from 'vue-router';
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";

const route = useRoute();
const cardId = Number(route.params.id);

const cards = [
  {
    title: "Режим дня и школьные трудности. История Дениса",
    source: "Трудности обучения в начальной школе: Причины, диагностика, комплексная помощь / М.М. Безруких. - М.: Эксмо, 2009. - 464 с. - (Растим первоклашку)",
    text: `И учителей, и родителей бывает сложно убедить в том, что значительная часть школьных проблем связана с организацией общего режима дня, с тем, как распределяются нагрузки. Все знают о значении правильного режима, но исследования показывают, что рациональным можно считать режим лишь 20% младших школьников.
    Вот два невыдуманных примера режима дня двух первоклассников, живущих в разных городах. О проблемах этих детей разговор особый.

    Денису 6,5 лет, он первоклассник элитной школы. Семья живет за городом, поэтому дорога в школу (на машине) занимает не меньше часа. Встает Денис в семь, мама обычно минут 15 будит его, он просыпается с трудом и всегда «в плохом настроении». Дальше рассказ мамы: «Ходит полусонный, почти не ест, умывается и даже одевается с моей помощью. Все всегда забывает, а потом еще в машине досыпает». Занятия в школе начинаются в 8.30. В день обычно пять 35-минутных уроков с одной большой получасовой переменой. Поэтому вполне естественны нарушения внимания, ошибки, двигательное беспокойство и рост эмоционального напряжения к концу занятий. Негативные эмоции из-за неудач, огорчения мамы, невозможность сделать то, что нужно, часто заканчиваются истериками или взрывами агрессивности.
    Первые два урока Денис — полусонный (жалобы учительницы), а потом — «угомонить невозможно». Занятия заканчиваются в 12.35, и примерно к двум часам Денис дома. Обедает, полчаса отдыхает. С трех до пяти часов три раза в неделю занимается английским с учительницей и два раза в это же время — музыкой. Потом примерно час гуляет во дворе, играет с собакой, катается на велосипеде или роликовых коньках, зимой расчищает дорожки и т.п. ужинает, смотрит телевизор и часов в семь, иногда ввосемь садится за уроки. Вот тогда и начинается самое мученье. «Заниматься не хочет, ничего не помнит, ничего не знает, как будто в школе не был, — продолжает рассказ мама. — Он сам называет это сражением. Я сним сражаюсь, требую, чтобы все сделал сначала на черновике, потом аккуратно переписал, иначе все исправлять приходиться. Сражаемся с переменным успехом. Иногда я сдаюсь, и часть заданий так и остаются невыполненными. Иногда сидим допоздна (бывает и до одиннадцати). В последнее время (разговор с мамой — в марте) наши сражения заканчиваются какими-то агрессивными выходками Дениса — то тетрадь разорвет, то со стола все сбросит, а недавно я вышла, а он порезал ножницами занавеску на окне (его письменный стол стоит у окна). Долго не могу уложить его спать, большой уже, а все «песенку спой», «сказку расскажи». Спит тревожно, крутится, иногда вскрикивает».
    Следует заметить, что на вопрос об успехах занятий английским и музыкой мама ответила весьма красноречиво: «Не знаю, будет ли он знать английский, но музыкантом точно не будет». Мама считает, что «главная проблема — школа. Он ведь до школы очень хорошо читал и пересказывал, а теперь читает и не может уловить смысл, много ошибок, пишет неграмотно, неаккуратно и по математике отстает».
    `
  },
  {
    title: "Нарушения режима и их последствия",
    source: "Трудности обучения в начальной школе: Причины, диагностика, комплексная помощь / М.М. Безруких. - М.: Эксмо, 2009. - 464 с. - (Растим первоклашку)",
    text: `Сопоставим примерный рекомендуемый режим дня первоклассника (А) и режим дня Дениса (Б):

    Первое — сон, который должен восстановить силы ребенка, снять напряжение, накопленное в течение дня. Сон должен быть достаточным по продолжительности. Для шестилетнего Дениса — не менее 10 часов, а он спит в лучшем случае 8 часов. Кроме того, сон Дениса беспокойный, а значит, он фактически не отдыхает, и вполне понятно, почему утром ему трудно встать. Здоровый ребенок должен проснуться бодрым, обязательно сделать зарядку (10—15 минут самых простых упражнений под музыку прогонят сон), умыться, обтереться мокрым полотенцем или принять душ. Завтрак, причем горячий, с вкусной кашей, стаканом сока, а не с сухим бутербродом, обязателен.
    Эти элементы режима у Дениса отсутствуют. Двухчасовая дорога в школу и обратно тоже могла бы использоваться. Мы не обсуждаем целесообразность столь длительных поездок, которые, конечно, утомляют ребенка (об этом должны подумать родители, когда выбирают школу). Это могло бы быть наблюдение за изменением природы, повторение стихотворения, или таблицы умножения, или, наконец, заданий по английскому (варианты можно найти). Тогда первые два урока не проходили бы бесполезно (все это приходится учить вечером).
    Эффективность вечерних занятий очень низка, и поэтому школьные трудности накапливаются и становятся все более выраженными, несмотря на то что школьные условия почти идеальны. Как показывает опыт, большая часть учащихся начальной школы готовит уроки вечером, когда родители приходят с работы. Родители считают, что ученикам младших классов необходим контроль, причем контроль не только результатов выполнения домашних заданий, но и текущий контроль по ходу выполнения этих заданий. Так и сидят мамы и бабушки (иногда папы) за спиной ребенка, направляя, подсказывая, предупреждая... И ребенок привыкает не контролировать свою работу, не отвечать за ее результат. Больше того — постоянный контроль раздражает, создает напряжение, и нередко подобное приготовление уроков заканчивается вспышкой (всплеском) эмоций, агрессией. Эта ситуация характерна и для Дениса.`
  },
  {
    title: "Режим дня Игоря и выявленные проблемы",
    source: "Трудности обучения в начальной школе: Причины, диагностика, комплексная помощь / М.М. Безруких. - М.: Эксмо, 2009. - 464 с. - (Растим первоклашку)",
    text: `Разберем еще один пример. Игорю тоже 6,5 лет. Он — «студент ОБ класса Университета...› (не будем называть Университет, но так написано в характеристике школьного психолога — «нулевого Б класса»). Первый год в школе, ноябрь, любые проблемы еще возможны — адаптация. Но угроза отчисления заставила родителей приехать на консультацию, чтобы разобраться, в чем причина серьезных проблем, проблем неожиданных, на которые остро реагируют и родители (недоумевают и гневаются), и сам Игорь (огорчен и растерян).
    Из характеристики учителя: «Невнимателен, рассеян, постоянно крутится, на вопросы отвечает невпопад... в тетрадях грязь, часто выполняет не те задания, которые заданы, много исправлений, ошибок, не помнит написание букв, все буквы неровные, сильный нажим, даже лист прорывает... при чтении торопится, пропускает слоги, слова... плохо выполняет математические задания, много ошибок, не доводит задание до конца... из-за постоянных отвлечений выполняет только часть заданий... еще ему очень трудно танцевать, он совсем не помнит движений, плохо координирует их».
    Из характеристики психолога: «Ребенок импульсивен... хорошо развит, но моторно неловок, речь образная, богатый словарный запас, хорошо общается, мотивация учения — высокая, однако несформированы приемы учебной деятельности...»
    Из рассказа мамы: «Он был очень хорошо подготовлен к школе, читает с четырех лет, пишет сказки, вместе с братом (он старше на два года) решает всякие головоломки и в «Монополию» его обыгрывает, и в шахматы играет. Что происходит в школе — непонятно. Кажется, все, что проходят в школе, он не слышит, не видит, не знает. Стал хуже и неохотно читать, раньше читал с выражением, четко, ясно, а теперь глотает окончания слов, или вдруг — пауза в середине слова. Я сним уроки делать не могу, нервничаю, срываюсь, поэтому уже две недели к нам приходит учительница-пенсионерка, очень спокойная, знающая, занимается с ним по два часа, больше просто нет времени».
    На просьбу описать один день Игоря с утра до вечера мама рассказала: «Встает в семь — семь двадцать (когда как разбудить удается), одевается, умывается, завтракает без особого желания — чаще стакан сока, тост с сыром. В школу идет со старшим братом. Занятия с 8.30 до 13.30, иногда бывает факультатив, тогда заканчивает в 14—14.15. Дома — обычно к 15 часам, обедает (тоже без желания). В 15.30 приходит учительница, занимаются 1,5—2 часа. В 18.15 он уже должен быть в музыкальной школе (2 раза в неделю до 19 часов) или в английской школе (он ходит туда тоже два раза в неделю второй год, занятия до 19.30). Вечером нужно еще позаниматься музыкой или английским (английский обычно оставляем на субботу, воскресенье), и телевизор посмотреть хочется, и поиграть. Спать ложится поздно, раньше одиннадцати уложить невозможно, у них с братом вся активная жизнь после девяти начинается... Он так активен вечером, как будто целый день ничего не делал. Совсем не устает. Правда, обычно заканчивается это слезами — то с братом поспорят, то подерутся, то отец прикрикнет — обидится, то вредничать начинает — это не так, это не буду... Зато в субботу и воскресенье отсыпаются до бассейна (на плавание к 13.00).
    Услышав вопрос: «Когда Игорь бывает на воздухе?» — мама даже возмутилась: «Когда же гулять, у нас нет времени, мы и так на тхеквондо перестали ходить, ребенку нужно спортом заниматься, но некогда».
    Подведем итог. Три месяца ребенок трудится без отдыха (одна нагрузка сменяет другую), без воздуха (без прогулок на воздухе, не считая дорогу в школу и обратно), без нормального сна. При этом одна неудача следует за другой, и школьные проблемы накапливаются. Часть из них связана с нарушениями режима, перегрузкой и перенапряжением.`
  },
  {
    title: "Анализ режима дня школьников: итоги и рекомендации",
    source: "Трудности обучения в начальной школе: Причины, диагностика, комплексная помощь / М.М. Безруких. - М.: Эксмо, 2009. - 464 с. - (Растим первоклашку)",
    text: `Особенно важно проанализировать режим дня тех школьников, у которых есть трудности обучения, а при выборе мер коррекции первым условием должна быть нормализация режима.
    Любому учителю важно знать реальную картину учебной нагрузки своих учеников. Наш недавний опрос более ста учителей начальных классов показал, что реальная ситуация организации режима дня своих учеников практически неизвестна. Анализ режима дня, который они провели в своих классах, оказался настолько неожиданным, что пришлось провести круглый стол для обсуждения выявленных проблем. Самой большой неожиданностью для всех учителей была продолжительность приготовления домашних заданий. Почему-то почти все были уверены, что дети мало занимаются (а главное, считали, что в этом нет большой необходимости, так как все «разжевывают» в классе). Исключением были учителя школ с углубленным изучением иностранных языков, но и они были уверены, что основное время приготовления домашних заданий отводится на иностранный язык, а оказалось, что это время распределяется почти равномерно на все предметы.
    Еще одним удивительным для педагогов фактом было практически полное отсутствие времени на прогулки. Раньше вместо прогулки дети сидели у телевизора, а теперь уже с первого класса почти 60% детей проводят за компьютером 1—1,5 часа.`
  }
];

const scheduleComparison = {
  recommended: [
    "7:00 — Пробуждение",
    "7:00–7:30 — Утренняя гимнастика, закаливающие процедуры",
    "7:30–7:50 — Умывание, уборка постели, завтрак",
    "7:50–8:20 — Дорога в школу",
    "8:20–12:30 — Занятия в школе",
    "12:30–13:00 — Дорога из школы домой (прогулка)",
    "13:00–13:30 — Обед",
    "13:30–14:30 — Дневной сон или отдых",
    "14:30–16:00 — Прогулка на воздухе",
    "16:00–17:00 — Приготовление уроков",
    "22:30(23:00) — Сон",
  ],
  denis: [
    "7:00 — Пробуждение, завтрак",
    "7:30–8:30 — Дорога в школу",
    "8:30–12:30 — Занятия в школе",
    "12:30–14:00 — Дорога домой",
    "14:00–15:00 — Обед, отдых",
    "15:00–17:00 — Занятия английским или музыкой",
    "17:00–18:00 — Прогулка",
    "18:00–19:00 — Ужин, отдых",
    "19:00–22:00 — Домашние задания",
    "22:30(23:00) — Сон",
  ]
};


const currentCard = cards[cardId];
</script>

<template>
  <Header/>
  <div class="px-12 py-8 flex flex-col mb-11">
    <h1 class="text-orange-500 text-7xl mb-6">
      Поговорим о педагогике
    </h1>
    <h1 class="text-orange-500 text-[55px] opacity-80">
      {{ currentCard.title }}
    </h1>
    <b class="lg:text-xl text-3xl whitespace-pre-line mb-6 opacity-80">
      {{ currentCard.source }}
    </b>
    <div class="lg:text-xl text-4xl whitespace-pre-line opacity-80" v-if="cardId !== 1">
      {{ currentCard.text }}
    </div>

    <div v-else class="lg:text-xl text-3xl whitespace-pre-line opacity-80">
      <p v-for="(line, i) in currentCard.text.split('\\n')" :key="i">{{ line }}</p>

      <table class="table-auto border-collapse border border-gray-400 my-10 w-full text-left">
        <thead>
        <tr>
          <th class="border border-gray-400 px-4 py-2">Рекомендуемый режим (А)</th>
          <th class="border border-gray-400 px-4 py-2">Режим Дениса (Б)</th>
        </tr>
        </thead>
        <tbody>
        <tr v-for="(item, index) in scheduleComparison.recommended" :key="index">
          <td class="border border-gray-400 px-4 py-2">{{ item }}</td>
          <td class="border border-gray-400 px-4 py-2">{{ scheduleComparison.denis[index] || '' }}</td>
        </tr>
        </tbody>
      </table>
    </div>

  </div>
  <Footer/>
</template>
