<script setup>
import { useRoute } from 'vue-router';
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";

const route = useRoute();
const cardId = Number(route.params.id);

const cards = [
  {
    title: "Что формирует наши чувства и поведение с детства",
    source: "Не наступай на одни и те же грабли. Пойми своего внутреннего ребенка... / Гитта Якоб; [пер. О. Буркиной]. — СПб.: Портал, 2022. — 368 с. — (Серия \"Дела семейные\")",
    text: `Когда в нас пробуждается одна из трех внутренних Детей, наше восприятие и поведение кажутся такими же незрелыми. Мы интенсивно проживаем чувства, которые нельзя полностью объяснить текущей ситуацией. Объстоятельства напоминают нам сцены из детства и юности, в которых наши базовые потребности проигнорировали. Различают Печального, Капризного и Счастливого Ребенка.`
  },
  {
    title: "Требующий и Карающий Судья",
    source: "Не наступай на одни и те же грабли. Пойми своего внутреннего ребенка... / Гитта Якоб; [пер. О. Буркиной]. — СПб.: Портал, 2022. — 368 с. — (Серия \"Дела семейные\")",
    text: `Воплощают разрушающие голоса из нашего детства и юности. Они транслируют исключительно негативные послания. Из-за них мы чувствуем, что мы никогда не дотягиваем до нужного уровня, не стоим любви, что мы скучны, глупы, безобразны и некомпетенты. Следует различать Требующего Судью, который предъявляет нам претензии и держит нас под экстремальным давлением, и Карающего Судью, который нас обесценивает.
Кстати, если вы сейчас думаете: «Но ведь я и хорошего много слышал – мои родители и друзья несли не только негатив…», - то это превосходно! Соответствеющие послания («Я в порядке, я не должен все делать идеально») относятся ко взрослому Я.`
  },
  {
    title: "Детские стратегии преодоления",
    source: "Не наступай на одни и те же грабли. Пойми своего внутреннего ребенка... / Гитта Якоб; [пер. О. Буркиной]. — СПб.: Портал, 2022. — 368 с. — (Серия \"Дела семейные\")",
    text: `Как мы преодолеваем нечно тяжелое по-детски.
Для того чтобы справиться с эмоциональноц ношей и тяжелыми ситуациями, в детстве для самозащиты мы усваивали определенные виды поведения, которые позже закрепились. Часто у детей не бывает иного шанса, кроме как выбрать одну из этих форм преодоления: подчинение, избегание и гиперкомпенсацию. Многие люди во взрослом возрасте при сложных ситуациях по-прежнему обращаются к этим детским стратегиям, как будто это нормально.`
  }
];

const currentCard = cards[cardId];

const innerChildrenTable = [
  {
    label: "Какие чувства определяет внутренний Ребенок?",
    sad: "Стыд, одиночество, страх, грусть, беспомощность",
    defiant: "Ярость, злость, импульсивность, упрямство",
    happy: "Счастье, легкость, любопытство, уверенность"
  },
  {
    label: "Эти чувства появляются, когда…",
    sad: "Сталкиваешься с отказом, угрозой, несоразмерными требованиями, чувствуешь себя покинутым или отринутым",
    defiant: "Тебя критикуют, тебе отказывают, тебя не воспринимают всерьез, ты чувствуешь себя стесненным или отринутым",
    happy: "Ты чувствуешь, что тебя принимают, любят, ты чувствуешь принадлежность"
  },
  {
    label: "Цель работы с этим внутренним Ребенком…",
    sad: "Воспринимать и понимать свои потребности, самостоятельно заботиться об их удовлетворении",
    defiant: "Распознавать потребности за яростью и удовлетворять их, уменьшать проявления избалованности и упрямства",
    happy: "Наслаждаться этим в полной мере"
  },
  {
    label: "Что помогает внутреннему Ребенку?",
    sad: "Любовь к себе, принятие чувств, удовлетворение потребностей",
    defiant: "Возвращение контроля, забота о себе, осознанность, тренировка альтернативного поведения",
    happy: "Баланс, новые активности, радость от мелочей"
  },
  {
    label: "Осторожно с…",
    sad: "Карающим Судьей и поверхностным удовлетворением потребностей",
    defiant: "Упрямством и 'я хочу только так'",
    happy: "Карающим Судьей, считающим радость чем-то 'детским'"
  }
];

const judgesTable = [
  {
    label: "При этом речь идет о…",
    demanding: "Завышенные требования к себе в отношении достижений или экстремальных ожиданий от себя в плане заботы о других",
    punishing: "Иногда полном обесценивании собственной личности"
  },
  {
    label: "Ты чувствуешь…",
    demanding: "Давление, перегруженность, ущербность или вину",
    punishing: "Себя не стоящим любви, отталкивающим и/или отвергнутым, ненавидимым и ущербным"
  },
  {
    label: "Цель работы с внутренним Судьей – это…",
    demanding: "Изменить его послания таким образом, чтобы они стали помогать",
    punishing: "Понять, что у этих посланий нет оснований, что они должны исчезнуть"
  },
  {
    label: "Что поможет?",
    demanding: "Навык различать помогающие и вредные послания, перепроверка истинности послания и развитие новых помогающих посланий",
    punishing: "Идентификация источников послания Судьи, заглушение карающего голоса с помощью символов, карт воспоминаний, контакта с близкими"
  },
  {
    label: "Осторожно с…",
    demanding: "Стратегиями преодоления! Мы часто пытаемся уйти от внутреннего Судьи, избегая его. Как правило, это работает только на короткий срок.",
    punishing: ""
  }
];

const copingTable = [
  {
    label: "При этом люди пытаются",
    submission: "Упрочить свое положение, угождая другим",
    avoidance: "Избегать чувств и проблем, с которыми не хочется разбираться",
    compensation: "Вести себя зеркально противоположно тому, что заявляют голоса внутренних Судей"
  },
  {
    label: "Эта стратегия проявляется в…",
    submission: "Добровольном принятии на себя неприятных задач, неспособности сказать 'Нет', в зависимости от других людей",
    avoidance: "Избегании тяжелых ситуаций, чрезмерном отвлечении в компьютерных играх, интернете, просмотре ТВ и т.п.",
    compensation: "Заносчивости, контроле, привлекающем внимании, агрессии, манипуляциях"
  },
  {
    label: "Цель – это…",
    submission: "Научиться уменьшать проявления этих форм, соразмерно выражать потребности и конструктивно решать конфликты",
    avoidance: "",
    compensation: ""
  },
  {
    label: "Что помогает?",
    submission: "Взвешивать плюсы/минусы, пробовать вести себя иначе, быть терпеливым",
    avoidance: "",
    compensation: ""
  },
  {
    label: "Осторожно с…",
    submission: "Требующим Судьей ('Ты должен всем угодить'), Карающим Судьей ('Никто не захочет быть с тобой')",
    avoidance: "",
    compensation: "Карающим Судьей ('Если покажешь слабину, ты неудачник')"
  }
];
</script>

<template>
  <Header />
  <div class="px-12 py-8 flex flex-col mb-11">
    <h1 class="text-orange-500 text-7xl mb-6">
      Поговорим о психологии
    </h1>
    <h1 class="text-orange-500 text-[55px] opacity-80">
      {{ currentCard.title }}
    </h1>
    <b class="lg:text-xl text-3xl whitespace-pre-line mb-6">
      {{ currentCard.source }}
    </b>
    <p class="lg:text-xl text-4xl whitespace-pre-line mb-8">
      {{ currentCard.text }}
    </p>

    <table v-if="cardId === 0" class="table-auto border-collapse border border-gray-400 lg:text-xl text-3xl text-left w-full">
      <thead>
      <tr>
        <th class="border border-gray-400 px-4 py-2">Вопрос</th>
        <th class="border border-gray-400 px-4 py-2">Печальный Ребёнок</th>
        <th class="border border-gray-400 px-4 py-2">Капризный Ребёнок</th>
        <th class="border border-gray-400 px-4 py-2">Счастливый Ребёнок</th>
      </tr>
      </thead>
      <tbody>
      <tr v-for="(row, index) in innerChildrenTable" :key="index">
        <td class="border border-gray-400 px-4 py-2 font-semibold">{{ row.label }}</td>
        <td class="border border-gray-400 px-4 py-2">{{ row.sad }}</td>
        <td class="border border-gray-400 px-4 py-2">{{ row.defiant }}</td>
        <td class="border border-gray-400 px-4 py-2">{{ row.happy }}</td>
      </tr>
      </tbody>
    </table>

    <table v-if="cardId === 1" class="table-auto border-collapse border border-gray-400 lg:text-xl text-3xl text-left w-full mt-10">
      <thead>
      <tr>
        <th class="border border-gray-400 px-4 py-2">Показатель</th>
        <th class="border border-gray-400 px-4 py-2">Требующий Судья</th>
        <th class="border border-gray-400 px-4 py-2">Карающий Судья</th>
      </tr>
      </thead>
      <tbody>
      <tr v-for="(row, index) in judgesTable" :key="index">
        <td class="border border-gray-400 px-4 py-2 font-semibold">{{ row.label }}</td>
        <td class="border border-gray-400 px-4 py-2">{{ row.demanding }}</td>
        <td class="border border-gray-400 px-4 py-2">{{ row.punishing }}</td>
      </tr>
      </tbody>
    </table>

    <table v-if="cardId === 2" class="table-auto border-collapse border border-gray-400 lg:text-xl text-3xl text-left w-full mt-10">
      <thead>
      <tr>
        <th class="border border-gray-400 px-4 py-2">Показатель</th>
        <th class="border border-gray-400 px-4 py-2">Подчинение</th>
        <th class="border border-gray-400 px-4 py-2">Избегание</th>
        <th class="border border-gray-400 px-4 py-2">Гиперкомпенсация</th>
      </tr>
      </thead>
      <tbody>
      <tr v-for="(row, index) in copingTable" :key="index">
        <td class="border border-gray-400 px-4 py-2 font-semibold">{{ row.label }}</td>
        <template v-if="row.label === 'Осторожно с…'">
          <td class="border border-gray-400 px-4 py-2" colspan="2">
            {{ row.submission }}
          </td>
          <td class="border border-gray-400 px-4 py-2">
            {{ row.compensation }}
          </td>
        </template>
        <template v-else-if="row.avoidance === '' && row.compensation === ''">
          <td class="border border-gray-400 px-4 py-2" colspan="3">
            {{ row.submission }}
          </td>
        </template>
        <template v-else>
          <td class="border border-gray-400 px-4 py-2">{{ row.submission }}</td>
          <td class="border border-gray-400 px-4 py-2">{{ row.avoidance }}</td>
          <td class="border border-gray-400 px-4 py-2">{{ row.compensation }}</td>
        </template>
      </tr>
      </tbody>
    </table>
  </div>
  <Footer />
</template>
