<script setup>
import { useRoute } from 'vue-router';
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";

const route = useRoute();
const cardId = Number(route.params.id);

const cards = [
  {
    title: "Что формирует наши чувства и поведение с детства",
    text: `Когда в нас пробуждается одна из трёх внутренних Детей, наше восприятие и поведение становятся незрелыми. Мы проживаем сильные эмоции, не всегда соответствующие текущей ситуации — потому что она напоминает детский опыт, в котором наши базовые потребности не были удовлетворены.

           Эти части личности:
           - Печальный Ребёнок — стыд, одиночество, страх, беспомощность;
           - Капризный Ребёнок — ярость, злость, упрямство;
           - Счастливый Ребёнок — радость, уверенность, лёгкость.

            Работа с внутренними Детьми — это путь к осознанности и эмоциональной зрелости.`
  },
  {
    title: "Печальный, Капризный и Счастливый Ребёнок",
    text: `Печальный Ребёнок чувствует стыд, одиночество, грусть, беспомощность. Он возникает, когда мы сталкиваемся с отказом или угрозой. Ему помогает принятие собственных чувств и забота о себе. Осторожно: его легко заглушить внутренним Карающим Судьёй.

           Капризный Ребёнок проявляется в ярости и упрямстве. Он просит: «Обрати на меня внимание!» Чтобы помочь ему — распознавайте потребности за эмоциями и возвращайте себе контроль. Будьте внимательны к проявлениям избалованности или импульсивности.

           Счастливый Ребёнок активируется, когда мы чувствуем любовь и безопасность. Он помогает радоваться и быть настоящим. Важно разрешать себе чувствовать радость, несмотря на «взрослые» установки типа «это несерьёзно».`
  },
  {
    title: "Требующий и Карающий Судья",
    text: `Судьи — это голоса из детства, которые критиковали, требовали и обесценивали. Они делятся на:

          - Требующий Судья: «Ты должен быть идеальным», «Ты обязан». Это про перегрузку и давление.
          - Карающий Судья: «Ты не достоин любви», «Ты ничтожен». Это про стыд, самобичевание и отказ от себя.

          Работа с Судьями:
          - Перепроверка их посланий: имеют ли они под собой реальную основу?
          - Создание Помогающего Внутреннего Родителя: того, кто поддержит и защитит.

          Осторожно: избегание Судей с помощью «подавления» работает краткосрочно и усиливает внутренний конфликт.`
  },
  {
    title: "Детские стратегии преодоления: как мы защищались и что с этим делать",
    text: `В детстве, чтобы выжить эмоционально, мы формируем стратегии преодоления:

          - Подчинение: угождение другим, неспособность сказать «нет».
          - Избегание: уход в игры, сериалы, эмоциональное онемение.
          - Гиперкомпенсация: быть лучшим, казаться сильным, контролировать всё.

          Во взрослом возрасте эти стратегии мешают: они не гибкие, неэффективны и уводят от настоящего контакта с собой.

          Что помогает:
          - Осознать свои автоматизмы.
          - Пробовать новые способы реакции.
          - Быть терпеливым к себе: изменения приходят не сразу.

          Важно не позволять Судьям («Ты должен всем угодить», «Ты слабый») управлять взрослыми решениями.`
  }
];

const currentCard = cards[cardId];
</script>

<template>
  <Header/>
  <div class="px-12 py-8 flex flex-col mb-11">
    <h1 class="text-orange-500 text-[55px] mb-6">
      {{ currentCard.title }}
    </h1>
    <p class="lg:text-xl text-4xl whitespace-pre-line">
      {{ currentCard.text }}
    </p>
  </div>
  <Footer/>
</template>
