<script setup lang="ts">

import Header from "@/components/Header.vue";
import {Label} from "radix-vue";
</script>

<template>
  <Header/>
  <div class="px-8 py-3 md:px-11 md:py-6 lg:px-[55px] lg:py-8">
    <h1 class="text-center text-lg md:text-xl lg:text-2xl mb-4 lg:mb-8">
      Согласие на рекламную и информационну рассылку
    </h1>
    <div class="text-base md:text-lg lg:text-xl">
      <p>
        Настоящим, в соответствии с Федеральным законом «О персональных данных» от 27.07.2006 г. № 152-ФЗ, Федеральным
        законом «О рекламе» от 13.03.2006 г. № 38-ФЗ, своей волей и в своём интересе выражаю своё безусловное согласие
        ООО «Оранжевый помощник», ОГРН 1241600052418, ИНН 1683024239, юридический адрес: 422737, Республика Татарстан
        (Татарстан), м.р-н. Высокогорский, с.п. Бирюлинское, п.Бирюлинского Зверосовхоза, ул.Кольцевая, д.3А,
        кв.9.(далее по тексту – Оператор) на:
      </p>
      <p>
        1. Обработку моих персональных данных, не являющихся специальными или биометрическими, предоставляемых
        мною, которые включают:
      </p>
      <ul class="list-inside">
        <li>– e-mail</li>
      </ul>
      <p>
        2. Получение информационной e-mail-рассылки, в том числе информации рекламного характера
      </p>
      <p>
        3. Цель обработки: рассылка информационного материала и рекламы Пользователям посредством отправки электронных
        писем.
      </p>
      <p>
        4. Оператор может совершать следующие действия: сбор; запись; систематизация; накопление; хранение; уточнение
        (обновление, изменение); удаление.
      </p>
      <p>
        5. Способы обработки: как с использованием средств автоматизации, так и без их использования, смешанным
        способом.
      </p>
      <p>
        6. Настоящее согласие действует до момента его отзыва путём направления соответствующего заявления на
        электронный адрес:
        <a
            href="/" target="_blank"
            class="text-blue-600 underline"
        >
          oranzhevyi-pomoshnik.ru
        </a>
        или направления по адресу местонахождения Оператора или ликвидации
        организации.
      </p>
    </div>
  </div>
</template>

<style scoped>
p {
  margin-bottom: 10px;
}

ul li {
  margin-bottom: 10px;
}
</style>