<script setup lang="ts">

import Header from "@/components/Header.vue";
import {Label} from "radix-vue";
</script>

<template>
  <Header/>
  <div class="px-8 py-3 md:px-11 md:py-6 lg:px-[55px] lg:py-8">
    <h1 class="text-center text-lg md:text-xl lg:text-2xl mb-4 lg:mb-8">
      Согласие на обработку персональных данных
    </h1>
    <div class="text-base md:text-lg lg:text-xl">
      <p>Я, субъект персональных данных, настоящим в соответствии с Федеральным законом «О
        персональных данных» от 27 июля 2006 года № 152-ФЗ, оставляя свои персональные
        данные на веб-сайте oranzhevyi-pomoshnik.ru (далее – Сайт), действуя свободно, своей
        волей и в своём интересе, а также подтверждая свою дееспособность, даю своё согласие
        ООО «Оранжевый помощник», ОГРН 1241600052418, ИНН 1683024239 (далее –
        Оператор) на обработку своих персональных данных в соответствии с Политикой
        конфиденциальности, размещенной на сайте: oranzhevyi-pomoshnik.ru на следующих
        условиях:
      </p>
      <p>
        <strong>1. Цель обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>– Рассылка информационного материала и рекламы Пользователям посредством отправки электронных писем;</li>
        <li>– Подготовка, заключение и исполнение гражданско-правового договора;</li>
        <li>– Оказание платных консультационных услуг в сфере психологии и педагогики на веб-сайте
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>
        </li>
        <li>1.1. Также Оператор имеет право направлять Пользователю рассылку о новых продуктах и услугах,
          специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения
          информационных
          сообщений, направив Оператору письмо на адрес электронной почты
          <label class="text-blue-600 underline">orange_helper@mail.ru</label>
          с пометкой «Отказ от любых
          рассылок».
        </li>
        <li>1.2. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики,
          служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
        </li>
      </ul>


      <p>
        <strong>2. Перечень персональных данных, на обработку которых дается согласие</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>– фамилия, имя, отчество (в том числе детей);</li>
        <li>– контактный телефон;</li>
        <li>– электронная почта;</li>
        <li>– возраст (в том числе детей);</li>
        <li>– стаж работы (у специалистов Сайта);</li>
        <li>– образование (у специалистов Сайта);</li>
        <li>– специализация (у специалистов Сайта);</li>
        <li>– Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с
          помощью сервисов интернет-статистики (Яндекс Метрика, Гугл Аналитика и других).
        </li>
      </ul>

      <p>
        <strong>3. Перечень действий с персональными данными, на совершение которых дается согласие</strong>
      </p>
      <p>Любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств, с персональными данными, включая: сбор, запись,
        систематизацию, накопление, хранение, уточнение (обновление, изменение), использование, передачу
        (предоставление, доступ), уничтожение персональных данных.</p>

      <p>
        <strong>4. Способ обработки</strong>
      </p>
      <p>Обработка персональных данных может осуществляться как с использованием средств автоматизации, так и без
        использования таких средств, смешанным способом.</p>
      <p>При автоматизированной обработке моих персональных данных сайтом, Оператор может их передавать третьим лицам,
        на что я даю свое согласие Оператору на осуществление соответствующего поручения в отношении ООО «Яндекс», ОГРН
        1027700229193, зарегистрированному по адресу: 119021, город Москва, вн.тер.г. муниципальный округ Хамовники,
        улица Льва Толстого, дом 16.</p>

      <p>
        <strong>5. Настоящее согласие</strong>
      </p>
      <p>Настоящее согласие действует до дня прекращения деятельности Оператора, либо до момента его отзыва путём
        направления соответствующего заявления на электронную почту: orange_helper@mail.ru или направления по адресу:
        422773, Республика Татарстан (Татарстан) м.р-н Высокогорский, с.п. Бирюлинское, п Бирюлинского Зверосовхоза,
        ул.Кольцевая, д.3А, кв.9 в зависимости от того, какое событие настанет раньше.</p>
      <p>Подтверждаю, что моё согласие на обработку персональных данных является конкретным, предметным,
        информированным, сознательным и однозначным.</p>
    </div>
  </div>
</template>

<style scoped>
p {
  margin-bottom: 10px;
}

ul li {
  margin-bottom: 10px;
}
</style>