<script setup lang="ts">

import Header from "@/components/Header.vue";
import {Label} from "radix-vue";
</script>

<template>
  <Header/>
  <div class="px-8 py-3 md:px-11 md:py-6 lg:px-[55px] lg:py-8">
    <h1 class="text-center text-lg md:text-xl lg:text-2xl mb-4 lg:mb-8">
      Договор-оферта на оказание платных консультационных услуг психолога и/или педагога
    </h1>
    <div class="text-base md:text-lg lg:text-xl">
      <p>С. Высокая Гора</p>

      <p>
        <strong>1. Общие положения</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          1.1. ООО «Оранжевый помощник» в лице генерального директора Ильиной Ксении Алексеевны, именуемый в
          дальнейшем «Исполнитель», настоящей публичной офертой предлагает любому физическому или юридическому лицу, а
          также индивидуальному предпринимателю или самозанятому заключить Договор-оферту (далее «Договор», «Оферта»,
          «Договор-оферта») на оказание платных консультационных услуг психолога и/или педагога, далее «Консультации».
        </li>
        <li>
          1.2. В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (ГК РФ), в случае
          принятия изложенных ниже условий и оплаты услуг юридическое или физическое лицо, производящее акцепт этой
          оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению
          Договора на условиях, изложенных в оферте).
        </li>
        <li>
          1.3. Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить Договор оферты
          (акцептом оферты) считается факт подтверждения готовности совершить оплату услуги Исполнителя, посредством
          нажатия кнопки «Перейти к оплате» на сайте
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>
          или
          <label class="bg-yellow-400">перечислением оплаты на расчетный счет организации.</label>
        </li>
        <li>
          1.4. Осуществляя акцепт Договора в порядке, определенном п. 1.3 Договора, Заказчик подтверждает, что он
          ознакомлен, согласен, полностью и безоговорочно принимает все условия Договора в том виде, в каком они
          изложены в тексте Договора, в том числе в приложениях к Договору, являющихся его неотъемлемой частью.
        </li>
        <li>
          1.5. Заказчик согласен, что акцепт Договора в порядке, указанном в п. 1.2 Договора является заключением
          Договора на условиях, изложенных в нем.
        </li>
        <li>
          1.6. Договор не может быть отозван.
        </li>
        <li>
          1.7. Договор не требует скрепления печатями и/или подписания Заказчиком и Исполнителем (далее по тексту -
          Стороны) и сохраняет при этом юридическую силу.
        </li>
      </ul>

      <p>
        <strong>2. Предмет договора</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          2.1 Предметом настоящего Договора является оказание платных консультационных услуг психолога и/или педагога
          в соответствии с условиями настоящего Договора.
        </li>
        <li>
          2.2. Заказчик полностью принимает условия Договора и оплачивает услуги Исполнителя в соответствии с
          условиями настоящего Договора.
        </li>
      </ul>

      <p>
        <strong>3. Порядок оплаты</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          3.1. Стоимость Консультаций по Договору определяется в соответствии с действующими ценами и прописана на сайте
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>
        </li>
        <li>
          3.2. Стоимость Консультаций может быть изменена Исполнителем в одностороннем порядке.
        </li>
        <li>
          3.3. Настоящий Договор считается заключённым и вступает в силу с момента внесения оплаты Заказчиком. Оплата
          вносится в размере 100% предоплаты. Датой внесения оплаты считается дата зачисления денежных средств путём
          оплаты на расчётный счёт Исполнителя.
        </li>
        <li>
          3.4. Оплата может быть разделена на несколько платежей по предварительной договорённости с Исполнителем,
          согласно установленному графику платежей
        </li>
      </ul>

      <p>
        <strong>4. Права сторон</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          4.1. Исполнитель вправе:
        </li>
        <li>
          4.1.1. Определять время консультаций с психологом и/или педагогом.
        </li>
        <li>
          4.1.2. Требовать от Заказчика своевременной оплаты Консультаций, в соответствии с условиями настоящего
          Договора.
        </li>
        <li>
          4.1.3. Отправлять Заказчику запросы и получать от него разъяснения и уточнения по вопросам, связанным с
          надлежащим исполнением Договора.
        </li>
        <li>
          4.2. Заказчик вправе:
        </li>
        <li>
          4.2.1. Получать от Исполнителя предоставление информации по вопросам организации и обеспечения надлежащего
          проведения консультации с психологом и/или педагогом, предусмотренных разделом 1 настоящего Договора.
        </li>
      </ul>

      <p>
        <strong>5. Обязанности сторон</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          5.1. Обязанности Исполнителя:
        </li>
        <li>
          5.1.1. Организовать проведение консультации с педагогом и/или психологом.
        </li>
        <li>
          5.2. Обязанности Заказчика:
        </li>
        <li>
          5.2.1. Обеспечить явку на консультации с психологом и/или педагогом.
        </li>
        <li>
          5.2.2. Оплатить стоимость Консультаций в соответствии с условиями договора.
        </li>
      </ul>

      <p>
        <strong>6. Ответственность сторон</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          6.1. Исполнитель несет ответственность за своевременность проведения Консультаций, при выполнении Заказчиком
          установленных требований и правил, размещенных на сайте oranzhevyi-pomoshnik.ru.
        </li>
        <li>
          6.2. Исполнитель освобождается от ответственности за нарушение условий Договора, если такое нарушение вызвано
          действием обстоятельств непреодолимой силы (форс-мажор), включая: действия органов государственной власти,
          пожар, наводнение, землетрясение, другие стихийные действия, отсутствие электроэнергии, забастовки,
          гражданские волнения, беспорядки, любые иные обстоятельства, не ограничиваясь перечисленным, которые могут
          повлиять на выполнение Исполнителем Договора.
        </li>
        <li>
          6.3. Исполнитель не несет ответственности за качество каналов связи общего пользования или служб,
          предоставляющих доступ Заказчика к его услугам.
        </li>
      </ul>

      <p>
        <strong>7. Конфиденциальность и защита персональной информации</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          7.1. Исполнитель обязуется не разглашать полученную от Заказчика информацию.
        </li>
        <li>
          7.2. Не считается нарушением обязательств разглашение информации в соответствии с обоснованными и применимыми
          требованиями закона.
        </li>
        <li>
          7.3. На Сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью
          сервисов интернет-статистики (Яндекс Метрика).
        </li>
        <li>
          7.4. Исполнитель не несет ответственности за сведения, предоставленные Заказчиком на сайте
          oranzhevyi-pomoshnik.ru в общедоступной форме.
        </li>
      </ul>

      <p>
        <strong>8. Разрешение споров</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          8.1. Претензии Заказчика по предоставляемым Консультациям принимаются Исполнителем к рассмотрению по
          электронной почте в течение 2 (рабочих) дней с момента возникновения спорной ситуации.
        </li>
        <li>
          8.2. При рассмотрении спорных ситуаций Исполнитель вправе запросить у Заказчика всю интересующую документацию
          относительно рассматриваемого вопроса. В случае непредоставления Заказчиком документов в течение 1 рабочего
          дня после дня требования, претензия рассмотрению Исполнителем не подлежит.
        </li>
      </ul>

      <p>
        <strong>9. Прочие условия</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>
          9.1. Заказчик обладает всеми правами и полномочиями, необходимыми для заключения и исполнения Договора.
        </li>
        <li>
          9.2. Исполнитель оставляет за собой право изменять или дополнять любые из условий настоящего Договора в любое
          время, опубликовывая все изменения на своём сайте и/или делая соответствующую рассылку.
        </li>
        <li>
          9.3. По всем вопросам, не урегулированным настоящим Договором, стороны руководствуются действующим
          законодательством Российской Федерации.
        </li>
        <li>
          9.4. Признание судом недействительности какого-либо положения настоящего Договора и правил не влечет за собой
          недействительность остальных положений.
        </li>
      </ul>

      <p>
        <strong>10. Реквизиты Исполнителя</strong>
      </p>
      <p>«ИСПОЛНИТЕЛЬ»</p>
      <p>ООО «Оранжевый помощник»</p>
      <p>Юридический адрес: 422737, Республика Татарстан (Татарстан), м.р-н Высокогорский, с.п. Бирюлинское, п.
        Бирюлинского Зверосовхоза, ул.Кольцевая, д.3А, кв.9.</p>
      <p>Почтовый адрес: 422737, Республика Татарстан (Татарстан), м.р-н Высокогорский, с.п. Бирюлинское, п.
        Бирюлинского Зверосовхоза, ул.Кольцевая, д.3А, кв.9.</p>
      <p>ИНН: 1683024239</p>
      <p>ОГРН: 1241600052418</p>

      <p><strong> Банковские реквизиты:</strong></p>
      <p>Банк: отделение «Банк Татарстан» №8610 ПАО Сбербанк</p>
      <p>БИК: 049205603</p>
      <p>ИНН 7707083893</p>
      <p>КПП 165502001</p>
      <p>Расчётный счет: 40702 810 7 6200 0115023</p>
      <p>Кор. счет: 30101 810 6 0000 0000603</p>

      <p>
        <strong>11. Контакты</strong>
      </p>
      <p>Почта для обращений: orange_helper@mail.ru</p>
      <p>Telegram: <a href="https://t.me/orange_helper" target="_blank">https://t.me/orange_helper</a></p>
    </div>
  </div>
</template>

<style scoped>
p {
  margin-bottom: 10px;
}

ul li {
  margin-bottom: 10px;
}
</style>