<script setup lang="ts">
import Header from "@/components/Header.vue";
import {Label} from "radix-vue";
</script>

<template>
  <Header/>
  <div class="px-8 py-3 md:px-11 md:py-6 lg:px-[55px] lg:py-8">
    <h1 class="text-center text-lg md:text-xl lg:text-2xl mb-4 lg:mb-8">
      ООО «Оранжевый помощник»
      <br/>
      Политика конфиденциальности
    </h1>
    <div class="text-base md:text-lg lg:text-xl">
      <div class="flex justify-between mb-4 lg:mb-8">
        <label class="block">С. Высокая Гора</label>
        <label class="block">25.08.2025</label>
      </div>

      <p>
        <strong>1. Общие положения</strong><br/>
        Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от
        27.07.2006. №152-ФЗ «О персональных данных» (далее - Закон о персональных данных) и определяет порядок обработки
        персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые ООО «Оранжевый
        помощник», в лице Генерального директора Ильиной Ксении Алексеевны (далее – Оператор).
      </p>

      <ul class="list-inside mb-4 lg:mb-8">
        <li>1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности: соблюдение прав и
          свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на
          неприкосновенность частной жизни, личную и семейную тайну.
        </li>
        <li>1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется
          ко всей информации, которую Оператор может получить о посетителях веб-сайта
          <a href="/" target="_blank" class="text-blue-600 underline">oranzhevyi-pomoshnik.ru</a>.
        </li>
      </ul>

      <p>
        <strong>2. Основные понятия, используемые в Политике</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств
          вычислительной техники.
        </li>
        <li>2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением
          случаев, если обработка необходима для уточнения персональных данных).
        </li>
        <li>2.3. Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных,
          обеспечивающих их доступность в сети интернет по сетевому адресу
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>.

        </li>
        <li>2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных
          данных и обеспечивающих их обработку информационных технологий и технических средств.
        </li>
        <li>2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без
          использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному
          субъекту персональных данных.
        </li>
        <li>2.6. Обработка персональных данных – любое действие (операция) или совокупность действий (операций),
          совершаемых с использованием средств автоматизации или без использования таких средств с персональными
          данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
          использование, передачу (предоставление, доступ), обезличивание, уничтожение, удаление персональных данных.
        </li>
        <li>2.7. Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно
          или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также
          определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия
          (операции), совершаемые с персональными данными.
        </li>
        <li>2.8. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или
          определяемому Пользователю веб-сайта
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>.
        </li>
        <li>2.9. Персональные данные, разрешенные субъектом персональных данных для распространения - персональные
          данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи
          согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в
          порядке, предусмотренном Законом о персональных данных.
        </li>
        <li>2.10. Пользователь – любой посетитель веб-сайта
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>.
        </li>
        <li>2.11. Предоставление персональных данных – действия, направленные на раскрытие персональных данных
          определенному лицу или определенному кругу лиц.
        </li>
        <li>2.12. Уничтожение персональных данных – любые действия, в результате которых персональные данные
          уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в
          информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных.
        </li>
      </ul>

      <p>
        <strong>3. Основные права и обязанности Оператора</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>3.1. Оператор имеет право:
          <ul>
            <li>— получать от субъекта персональных данных достоверные информацию и/или документы, содержащие
              персональные
              данные;
            </li>
            <li>— в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор
              вправе
              продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований,
              указанных в Законе о персональных данных;
            </li>
            <li>— самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения
              обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными
              правовыми актами, если иное не предусмотрено Законом о персональных данных или другими федеральными
              законами.
            </li>
          </ul>
        </li>
        <li>3.2. Оператор обязан:
          <ul>
            <li>— предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его
              персональных данных;
            </li>
            <li>— организовывать обработку персональных данных в порядке, установленном действующим законодательством
              РФ;
            </li>
            <li>— отвечать на обращения и запросы субъектов персональных данных и их законных представителей в
              соответствии с требованиями Закона о персональных данных;
            </li>
            <li>— сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа
              необходимую информацию в течение 30 дней с даты получения такого запроса;
            </li>
            <li>— публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении
              обработки персональных данных;
            </li>
            <li>— принимать правовые, организационные технические меры для защиты персональных данных от неправомерного
              или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления,
              распространения персональных данных, а также от иных неправомерных действий в отношении персональных
              данных;
            </li>
            <li>— прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить
              обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных
              данных;
            </li>
            <li>— исполнять иные обязанности, предусмотренные Законом о персональных данных.</li>
          </ul>
        </li>
      </ul>

      <p>
        <strong>4. Основные права и обязанности субъектов персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>4.1. Субъекты персональных данных имеют право:
          <ul>
            <li>— получать информацию, касающуюся обработки его персональных данных, за исключением случаев,
              предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в
              доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам
              персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких
              персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных;
            </li>
            <li>— требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае,
              если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются
              необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих
              прав;
            </li>
            <li>— выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на
              рынке товаров, работ и услуг;
            </li>
            <li>— на отзыв согласия на обработку персональных данных;</li>
            <li>— обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке
              неправомерные действия или бездействие Оператора при обработке его персональных данных;
            </li>
            <li>— на осуществление иных прав, предусмотренных законодательством РФ.</li>
          </ul>
        </li>
        <li>4.2. Субъекты персональных данных обязаны:
          <ul>
            <li>— предоставлять Оператору достоверные данные о себе;</li>
            <li>— сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.</li>
          </ul>
        </li>
        <li>4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных
          данных без согласия последнего, несут ответственность в соответствии с законодательством РФ.
        </li>
      </ul>

      <p>
        <strong>5. Оператор может обрабатывать следующие персональные данные Пользователя</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>5.1. Фамилия, имя, отчество (в том числе детей);</li>
        <li>5.2. Контактный телефон;</li>
        <li>5.3. Электронная почта;</li>
        <li>5.4. Возраст (в том числе детей);</li>
        <li>5.5. Стаж работы (только у специалистов Сайта);</li>
        <li>5.6. Образование (только у специалистов Сайта);</li>
        <li>5.7. Специализация (только у специалистов Сайта);</li>
        <li>5.8. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с
          помощью сервисов интернет-статистики (Яндекс Метрика).
        </li>
        <li>5.9. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.</li>
        <li>5.10. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности,
          политических взглядов, религиозных или философских убеждений, интимной жизни, Оператором не осуществляется.
        </li>
      </ul>

      <p>
        <strong>6. Принципы обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>6.1. Обработка персональных данных осуществляется на законной и справедливой основе;</li>
        <li>6.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных
          целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных;
        </li>
        <li>6.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется
          в целях, несовместимых между собой;
        </li>
        <li>6.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки;</li>
        <li>6.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не
          допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки;
        </li>
        <li>6.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в
          необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает
          необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных;
        </li>
        <li>6.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных
          данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных
          данных не установлен федеральным законом. Обрабатываемые персональные данные уничтожаются либо обезличиваются
          по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не
          предусмотрено федеральным законом.
        </li>
      </ul>

      <p>
        <strong>7. Цели обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>7.1. Цель обработки персональных данных Пользователя:
          <ul>
            <li>— Рассылка информационного материала и рекламы Пользователям посредством отправки электронных писем;
            </li>
            <li>— Подготовка, заключение и исполнение гражданско-правового договора;</li>
            <li>— Оказание платных консультационных услуг в сфере психологии и педагогики на веб-сайте
              <a
                  href="/" target="_blank"
                  class="text-blue-600 underline"
              >
                oranzhevyi-pomoshnik.ru
              </a>.
            </li>
          </ul>
        </li>
        <li>7.2. Также Оператор имеет право направлять Пользователю рассылку о новых продуктах и услугах, специальных
          предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений,
          направив Оператору письмо на адрес электронной почты <label class="text-blue-600 underline">orange_helper@mail.ru</label>
          с пометкой «Отказ от любых
          рассылок».
        </li>
        <li>7.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора
          информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
        </li>
      </ul>

      <p>
        <strong>8. Правовые основания обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>8.1. Правовыми основаниями обработки персональных данных Оператором являются:
          <ul>
            <li>— уставные (учредительные) документы Оператора;</li>
            <li>— договоры, заключаемые между оператором и субъектом персональных данных;</li>
            <li>— федеральные законы, иные нормативно-правовые акты в сфере защиты персональных данных;</li>
            <li>— согласия Пользователей на обработку их персональных данных, на обработку персональных данных,
              разрешенных для распространения;
            </li>
            <li>— согласие Пользователя на рекламную и информационную рассылку.</li>
          </ul>
        </li>
        <li>8.2. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки
          Пользователем самостоятельно через специальные формы, расположенные на сайте
          <a
              href="/" target="_blank"
              class="text-blue-600 underline"
          >
            oranzhevyi-pomoshnik.ru
          </a>.
          или направленные Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои
          персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.
        </li>
        <li>8.3. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках
          браузера Пользователя (включено сохранение файлов «cookie»).
        </li>
        <li>8.4. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных и
          дает согласие свободно, своей волей и в своем интересе.
        </li>
      </ul>

      <p>
        <strong>9. Условия обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его
          персональных данных.
        </li>
        <li>9.2. Обработка персональных данных необходима для достижения целей, предусмотренных законом, для
          осуществления возложенных законодательством Российской Федерации на оператора функций, полномочий и
          обязанностей.
        </li>
        <li>9.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта
          другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской
          Федерации об исполнительном производстве.
        </li>
        <li>9.4. Обработка персональных данных необходима для исполнения договора-оферты.</li>
        <li>9.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или
          третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и
          свободы субъекта персональных данных.
        </li>
        <li>9.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен
          субъектом персональных данных либо по его просьбе (далее – общедоступные персональные данные).
        </li>
        <li>9.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в
          соответствии с федеральным законом.
        </li>
      </ul>

      <p>
        <strong>10. Порядок сбора, хранения, передачи и других видов обработки персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации
          правовых, организационных мер, необходимых для выполнения в полном объеме требований действующего
          законодательства в области защиты персональных данных.
        </li>
        <li>10.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие
          доступ к персональным данным неуполномоченных лиц.
        </li>
        <li>10.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за
          исключением случаев, связанных с исполнением действующего законодательства либо в случае, если субъектом
          персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения обязательств по
          гражданско-правовому договору.
        </li>
        <li>10.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их
          самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора
          <label class="text-blue-600 underline">orange_helper@mail.ru</label> с пометкой «Актуализация персональных
          данных».
        </li>
        <li>10.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны
          персональные данные, если иной срок не предусмотрен договором или действующим законодательством.
          Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив
          Оператору уведомление посредством электронной почты на электронный адрес Оператора
          <label class="text-blue-600 underline">orange_helper@mail.ru</label> с
          пометкой «Отзыв согласия на обработку персональных данных».
        </li>
        <li>10.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами
          связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с
          их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или Пользователь
          обязан самостоятельно своевременно ознакомиться с указанными документами. Оператор не несет ответственность за
          действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг.
        </li>
        <li>10.6. Установленные субъектом персональных данных запреты на передачу (кроме предоставления доступа), а
          также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для
          распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных
          публичных интересах, определенных законодательством РФ.
        </li>
        <li>10.7. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных.</li>
        <li>10.8. Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта
          персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения
          персональных данных не установлен федеральным законом.
        </li>
        <li>10.9. Условием прекращения обработки персональных данных может являться достижение целей обработки
          персональных данных, истечение срока действия согласия субъекта персональных данных или отзыв согласия
          субъектом персональных данных, а также выявление неправомерной обработки персональных данных.
        </li>
      </ul>

      <p>
        <strong>11. Перечень действий, производимых Оператором с полученными персональными данными</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>11.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление,
          изменение), использование, передачу (предоставление, доступ), обезличивание, уничтожение, удаление
          персональных данных.
        </li>
        <li>11.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей
          полученной информации по информационно-телекоммуникационным сетям или без таковой.
        </li>
      </ul>

      <p>
        <strong>12. Конфиденциальность персональных данных</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не
          распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено
          федеральным законом.
        </li>
      </ul>

      <p>
        <strong>14. Заключительные положения</strong>
      </p>
      <ul class="list-inside mb-4 lg:mb-8">
        <li>14.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его
          персональных данных, обратившись к Оператору с помощью электронной почты
          <label class="text-blue-600 underline">orange_helper@mail.ru</label>
        </li>
        <li>14.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором.
          Политика действует бессрочно до замены ее новой версией.
        </li>
        <li>14.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет на сайте
          oranzhevyi-pomoshnik.ru (внизу каждой страницы).
        </li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
p {
  margin-bottom: 10px;
}

ul li {
  margin-bottom: 10px;
}
</style>
